{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer": {"name": "input_layer:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "17"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_21_1/select_minmax_1/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/select_minmax_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_21_1/normalization_42_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/select_standard_1/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/select_standard_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_21_1/normalization_43_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/select_binary_1/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/select_binary_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/combined_features_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/dense_1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "17"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/dense_1_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_63_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_63_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/dense_2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_64_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_64_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/dense_3_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_65_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_65_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/output_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "17"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/select_minmax_1/GatherV2", "op": "GatherV2", "input": ["input_layer", "StatefulPartitionedCall/functional_21_1/select_minmax_1/GatherV2/indices", "StatefulPartitionedCall/functional_21_1/select_minmax_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_21_1/select_standard_1/GatherV2", "op": "GatherV2", "input": ["input_layer", "StatefulPartitionedCall/functional_21_1/select_standard_1/GatherV2/indices", "StatefulPartitionedCall/functional_21_1/select_standard_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_21_1/select_binary_1/GatherV2", "op": "GatherV2", "input": ["input_layer", "StatefulPartitionedCall/functional_21_1/select_binary_1/GatherV2/indices", "StatefulPartitionedCall/functional_21_1/select_binary_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_21_1/normalization_42_1/Sub", "op": "Sub", "input": ["StatefulPartitionedCall/functional_21_1/select_minmax_1/GatherV2", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/normalization_43_1/Sub", "op": "Sub", "input": ["StatefulPartitionedCall/functional_21_1/select_standard_1/GatherV2", "unknown_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/normalization_42_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/normalization_42_1/Sub", "ConstantFolding/StatefulPartitionedCall/functional_21_1/normalization_42_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/normalization_43_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/normalization_43_1/Sub", "ConstantFolding/StatefulPartitionedCall/functional_21_1/normalization_43_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/combined_features_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_21_1/normalization_42_1/truediv", "StatefulPartitionedCall/functional_21_1/normalization_43_1/truediv", "StatefulPartitionedCall/functional_21_1/select_binary_1/GatherV2", "StatefulPartitionedCall/functional_21_1/combined_features_1/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/dense_1_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_21_1/combined_features_1/concat", "StatefulPartitionedCall/functional_21_1/dense_1_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_21_1/dense_1_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_63_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/dense_1_1/Relu", "StatefulPartitionedCall/functional_21_1/batch_normalization_63_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_63_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_63_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_21_1/batch_normalization_63_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/dense_2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_63_1/batchnorm/add_1", "StatefulPartitionedCall/functional_21_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_21_1/dense_2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_64_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/dense_2_1/Relu", "StatefulPartitionedCall/functional_21_1/batch_normalization_64_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_64_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_64_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_21_1/batch_normalization_64_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/dense_3_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_64_1/batchnorm/add_1", "StatefulPartitionedCall/functional_21_1/dense_3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_21_1/dense_3_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_65_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/dense_3_1/Relu", "StatefulPartitionedCall/functional_21_1/batch_normalization_65_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_65_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_65_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_21_1/batch_normalization_65_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/output_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_65_1/batchnorm/add_1", "StatefulPartitionedCall/functional_21_1/output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_21_1/output_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/output_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_21_1/output_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_21_1/output_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_21_1/select_minmax_1/GatherV2/indices", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_21_1/select_minmax_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "unknown", "shape": [1, 4], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_21_1/normalization_42_1/truediv_recip", "shape": [1, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/select_standard_1/GatherV2/indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_21_1/select_standard_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_1", "shape": [1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_21_1/normalization_43_1/truediv_recip", "shape": [1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/select_binary_1/GatherV2/indices", "shape": [12], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_21_1/select_binary_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_21_1/combined_features_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_21_1/dense_1_1/Cast/ReadVariableOp", "shape": [17, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/dense_1_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_63_1/batchnorm/mul", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_63_1/batchnorm/sub", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/dense_2_1/Cast/ReadVariableOp", "shape": [256, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/dense_2_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_64_1/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_64_1/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/dense_3_1/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/dense_3_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_65_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_65_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/output_1/Cast/ReadVariableOp", "shape": [64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_21_1/output_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}